;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; sh-mode
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(require 'sh-script)

(defun sh-mode-hook--0 ()
  (setq sh-basic-offset 2) ; インデント幅の設定
  (setq sh-indentation 2)) ; インデント幅の設定

(add-hook 'sh-mode-hook 'sh-mode-hook--0)


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 1 行の文字数上限を越えた場合にハイライトする

(require 'highlight-column-limit)

(hcl:add-hook sh-mode-hook 80)


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(provide 'config-sh-mode)
